//Напишите цикл, который принимает на вход два числа (A и B)
//и возводит число A в натуральную степень B.

int x = 3;
int stepen = 5;
Console.WriteLine("5^3 = " + Math.Pow(x, stepen));

int x1 = 2;
int stepen1 = 4;
Console.WriteLine("4^2 = " + Math.Pow(x1, stepen1));